fabricio-godoi/u4cQueue/uNET/radio/cc2520/cc2520_new.c
/*
 * \author Fabricio Negrisolo de Godoi
 * \date 10-08-2017
 * \brief Driver for CC2520 radio from Texas Instruments
 */

#include "cc2520.h"

#include <stdlib.h>
#include "cc2520_arch.h"
#include "cc2520_config.h"
#include "cc2520_const.h"
#include "ieee802154.h"

// Stats
#include "unet_api.h"

static uint32_t (*_isr_handler)(void);
static radio_params_t cc2520_radio_params;

static int channel;

static is_cc2520_txing = FALSE;



//============================================================
//
//					     CONFIGURATION
//
//============================================================


//#define CC2520_DEBUG // NOTE: this could cause Cooja simulator to crash, probably problem with interruptions
#ifdef CC2520_DEBUG
#define CC2520_PRINTF  				PRINTF
#define CC2520_PRINTF_PACKET(buf,len)	packet_print(buf,len)
#else
#define CC2520_PRINTF(...)
#define CC2520_PRINTF_PACKET(buf,len)
#endif


/* Configuration */
#define WITH_SEND_CCA 1
#define FOOTER_LEN 2
#define CC2520_ACK_LENGTH 6	// [ LEN FRC.L FRC.M SQN FCH.L FCH.M ] ieee802.15.4
#define FOOTER1_CRC_OK      0x80
#define FOOTER1_CORRELATION 0x7f


#ifndef CC2520_CONF_AUTOACK
#define CC2520_CONF_AUTOACK              1
#endif /* CC2520_CONF_AUTOACK */

#define CC2520_AUTOCRC (1 << 6)
#define CC2520_AUTOACK (1 << 5)
#define FRAME_MAX_VERSION ((1 << 3) | (1 << 2))
#define FRAME_FILTER_ENABLE (1 << 0)
#define CORR_THR(n) (((n) & 0x1f) << 6)
#define FIFOP_THR(n) ((n) & 0x7f)

#define WITH_SEND_CCA 1
#define FOOTER_LEN 2
#define RTIMER_ARCH_SECOND 1000 //(4096U*8) // TODO got it from contiki, tune it
///
#define RTIMER_SECOND RTIMER_ARCH_SECOND
#define RTIMER_NOW() OSGetTickCount() //rtimer_arch_now()
#define RTIMER_CLOCK_LT(a,b)     ((signed short)((a)-(b)) < 0)
#define BUSYWAIT_UNTIL(cond, max_time)                                  \
  do {                                                                  \
	  unsigned long t0;                                                 \
    t0 = (unsigned long) RTIMER_NOW();                                  \
    while(!(cond) && RTIMER_CLOCK_LT(RTIMER_NOW(), t0 + (max_time)));   \
  } while(0)


#define asmv(arg) __asm__ __volatile__(arg)
int splhigh_(void) {
	int sr;
	/* Clear the GIE (General Interrupt Enable) flag. */
#ifdef __IAR_SYSTEMS_ICC__
	sr = __get_SR_register();
	__bic_SR_register(GIE);
#else
	asmv("mov r2, %0" : "=r" (sr));
	asmv("bic %0, r2" : : "i" (GIE));
#endif
	__no_operation(); // must be set after updating GIE /// Fabricio
	return sr & GIE; /* Ignore other sr bits. */
}
#define splhigh() splhigh_()
/// Set Processor Level
#define splx(sr) __asm__ __volatile__("bis %0, r2" : : "r" (sr))

void clock_delay_usec(uint16_t dt) {
	int i = 0;
	for (i = 0; i < dt * 6; i++) {
	};
}

static void strobe(uint8_t regname) {
	CC2520_STROBE(regname);
}

static uint8_t getreg(uint16_t regname) {
	uint8_t reg;
	CC2520_READ_REG(regname, reg);
	return reg;
}

static void setreg(uint16_t regname, uint8_t value) {
	CC2520_WRITE_REG(regname, value);
}

static unsigned int status(void) {
	uint8_t status;
	CC2520_GET_STATUS(status);

	return status;
}

static void flushrx(void) {
  uint8_t dummy;
  (void) dummy;
  CC2520_READ_FIFO_BYTE(dummy);
  CC2520_STROBE(CC2520_INS_SFLUSHRX);
  CC2520_STROBE(CC2520_INS_SFLUSHRX);
}

static void flushtx(void) {
  CC2520_STROBE(CC2520_INS_SFLUSHTX);
}

void clock_delay(unsigned int i) {
	while (i--) {
		_NOP();
	}
}

void cc2520_set_channel(uint8_t ch) {
	uint16_t f;

	/*
	 * Subtract the base channel (11), multiply by 5, which is the
	 * channel spacing. 357 is 2405-2048 and 0x4000 is LOCK_THR = 1.
	 */
	channel = ch;

	f = MIN_CHANNEL + ((channel - MIN_CHANNEL) * CHANNEL_SPACING);
	/*
	 * Writing RAM requires crystal oscillator to be stable.
	 */
	BUSYWAIT_UNTIL((status() & (BV(CC2520_XOSC16M_STABLE))),
			RTIMER_SECOND / 10); /// TODO status and BUSYWAIT

	/* Wait for any transmission to end. */
	BUSYWAIT_UNTIL(!(status() & BV(CC2520_TX_ACTIVE)), RTIMER_SECOND / 10);

	/* Define radio channel (between 11 and 25) */
	setreg(CC2520_FREQCTRL, f);

	/* If we are in receive mode, we issue an SRXON command to ensure
	 that the VCO is calibrated. */
	if ((status() & BV(CC2520_RX_ACTIVE))) {
		strobe(CC2520_INS_SRXON);
	}

	return;
}

void cc2520_set_pan_addr(unsigned pan, unsigned addr, const uint8_t *ieee_addr) {
	uint8_t tmp[2];

	/*
	 * Writing RAM requires crystal oscillator to be stable.
	 */
	BUSYWAIT_UNTIL(status() & (BV(CC2520_XOSC16M_STABLE)), RTIMER_SECOND / 10);

	tmp[0] = pan & 0xff;
	tmp[1] = pan >> 8;
	CC2520_WRITE_RAM(&tmp, CC2520RAM_PANID, 2);

	tmp[0] = addr & 0xff; /// L byte
	tmp[1] = addr >> 8;   /// H byte
	CC2520_WRITE_RAM(&tmp, CC2520RAM_SHORTADDR, 2);
	if (ieee_addr != NULL) {
		int f;
		uint8_t tmp_addr[8];
		// LSB first, MSB last for 802.15.4 addresses in CC2520
		for (f = 0; f < 8; f++) {
			tmp_addr[7 - f] = ieee_addr[f];
		}
		CC2520_WRITE_RAM(tmp_addr, CC2520RAM_IEEEADDR, 8);
	}
}
/*---------------------------------------------------------------------------*/
/**
 * \brief Set TX power
 *
 *        This routine sets the transmission power of the CC2520.
 */
void cc2520_set_tx_power(uint8_t pwr) {
//	set_long_add_mem(CC2520_RFCON3, pwr); // brtos
	setreg(CC2520_TXPOWER, pwr);
}
/*---------------------------------------------------------------------------*/
static void cc2520_rx_disable(void) {
	// need to set the RXENABLE0 register
	/* Disable packet reception */
	setreg(CC2520_RXENABLE0, 0x00); //  Does not abort ongoing TX/RX,
									// goes to idle when TX/RX is done
}
/*---------------------------------------------------------------------------*/
static void cc2520_rx_enable(void) {
	/* Enable packet reception */
//	strobe(CC2520_INS_SRXON); // Enable RX, set RXENABLE[15] register
							  // This strobe abort ongoing transmissions
//	The SRXON strobe:
//	o Sets RXENABLE[15]
//	o Aborts ongoing transmission/reception by forcing a transition to RX calibration.
//	• The STXON strobe when FRMCTRL1.SET_RXENMASK_ON_TX is enabled:
//	o Sets RXENABLE[14]
//	o The receiver is enabled after transmission completes.
//	• Setting RXENABLE != 0x0000:
//	o Does not abort ongoing transmission/reception.
	setreg(CC2520_RXENABLE0, 0x01); //  Does not abort ongoing TX/RX
}
/*---------------------------------------------------------------------------*/
/**
 * \brief Set radio configurations
 * \param opt radio options
 * \param value for setting the specific option value
 * \return -1 on error, 0 without error
 */
int cc2520_set(radio_opt_t opt, uint8_t value) {
	cc2520_radio_params.param[opt] = value; // refresh local mem information
	switch (opt) {
	case RADIO_STATE:
		break;
	case CHANNEL:
		//value = ((value - 11)%16)+11;
		cc2520_radio_params.param[opt] = value;
		cc2520_set_channel(value);
		break;
	case MACADDR16H:
		CC2520_WRITE_RAM(&value, CC2520RAM_SHORTADDR + 1, 1);
		break;
	case MACADDR16L:
		CC2520_WRITE_RAM(&value, CC2520RAM_SHORTADDR, 1);
		break;
	case PANID16H:
		CC2520_WRITE_RAM(&value, CC2520RAM_PANID + 1, 1);
		break;
	case PANID16L:
		CC2520_WRITE_RAM(&value, CC2520RAM_PANID, 1);
		break;
	case MACADDR64_7:
		CC2520_WRITE_RAM(&value, CC2520RAM_IEEEADDR + 7, 1);
		break;
	case MACADDR64_6:
		CC2520_WRITE_RAM(&value, CC2520RAM_IEEEADDR + 6, 1);
		break;
	case MACADDR64_5:
		CC2520_WRITE_RAM(&value, CC2520RAM_IEEEADDR + 5, 1);
		break;
	case MACADDR64_4:
		CC2520_WRITE_RAM(&value, CC2520RAM_IEEEADDR + 4, 1);
		break;
	case MACADDR64_3:
		CC2520_WRITE_RAM(&value, CC2520RAM_IEEEADDR + 3, 1);
		break;
	case MACADDR64_2:
		CC2520_WRITE_RAM(&value, CC2520RAM_IEEEADDR + 2, 1);
		break;
	case MACADDR64_1:
		CC2520_WRITE_RAM(&value, CC2520RAM_IEEEADDR + 1, 1);
		break;
	case MACADDR64_0:
		CC2520_WRITE_RAM(&value, CC2520RAM_IEEEADDR, 1);
		break;
#if 0
		case MACADDR16:
			setreg(value);
		break;
		case MACADDR64:
			setreg(value);
		break;
		case PANID:
			setreg(value);
		cc2520_radio_params.param[opt] = value;
		break;
#endif
	case TXPOWER:
		if (value > 31)
			value = 31;
		cc2520_radio_params.param[opt] = value;
		cc2520_set_tx_power(CC2520_TX_PWR_SET(((value >> 3) & 0x3), (value & 0x7))); /// TODO this is right?
		break;
	default:
		return -1;
		break;
	}
	return 0;
}

/**
 * \brief Get radio configurations
 * \param opt radio options from radio_opt_t enum
 * \param value of return of the radio configuration
 * \return -1 on error, 0 without error
 */
int cc2520_get(radio_opt_t opt, uint8_t *value) {
	*value = cc2520_radio_params.param[opt];

	switch(opt){
//		case MACADDR16:
//			CC2520_READ_RAM(value, CC2520RAM_SHORTADDR, 2);
//			break;
		case MACADDR16H:
			CC2520_READ_RAM(value, CC2520RAM_SHORTADDR + 1, 1);
			break;
		case MACADDR16L:
			CC2520_READ_RAM(value, CC2520RAM_SHORTADDR, 1);
			break;
//		case PANID:
//			CC2520_READ_RAM(value, CC2520RAM_PANID, 2);
//			break;
		case PANID16H:
			CC2520_READ_RAM(value, CC2520RAM_PANID + 1, 1);
			break;
		case PANID16L:
			CC2520_READ_RAM(value, CC2520RAM_PANID, 1);
			break;
//		case MACADDR64:
//			CC2520_READ_RAM(value, CC2520RAM_IEEEADDR, 8);
//			break;
		case MACADDR64_7:
			CC2520_READ_RAM(value, CC2520RAM_IEEEADDR + 7, 1);
			break;
		case MACADDR64_6:
			CC2520_READ_RAM(value, CC2520RAM_IEEEADDR + 6, 1);
			break;
		case MACADDR64_5:
			CC2520_READ_RAM(value, CC2520RAM_IEEEADDR + 5, 1);
			break;
		case MACADDR64_4:
			CC2520_READ_RAM(value, CC2520RAM_IEEEADDR + 4, 1);
			break;
		case MACADDR64_3:
			CC2520_READ_RAM(value, CC2520RAM_IEEEADDR + 3, 1);
			break;
		case MACADDR64_2:
			CC2520_READ_RAM(value, CC2520RAM_IEEEADDR + 2, 1);
			break;
		case MACADDR64_1:
			CC2520_READ_RAM(value, CC2520RAM_IEEEADDR + 1, 1);
			break;
		case MACADDR64_0:
			CC2520_READ_RAM(value, CC2520RAM_IEEEADDR, 1);
			break;
		default:
			return -1;
			break;
	}

