fabricio-godoi/u4cQueue/uNET/radio/cc2520/cc2520_new.c
			// Wait end of transmission, signed in the SFD interruption
			return RADIO_TX_WAIT;
		}
	}

	// Transmission never started
	/* If we are using WITH_SEND_CCA, we get here if the packet wasn't
	 transmitted because of other channel activity. */
	// Return the radio to RX
	NODESTAT_UPDATE(radiocol);
	CC2520_PRINTF("cc2520: TX Collision, transmission never start\n");
	UNET_RADIO.set(TX_STATUS, RADIO_TX_ERR_COLLISION); // RADIO_TX_WAIT
	UNET_RADIO.set(TX_RETRIES, 0);
	return RADIO_TX_ERR_COLLISION;
}

/*---------------------------------------------------------------------------*/
int cc2520_write(const void *buf, uint16_t len) {
	int ret = -1;

	// Error in packet size
	if (((len + FOOTER_LEN) <= 0) || ((len + FOOTER_LEN) > 127)) {
		return -1;
	}

	uint8_t *frame_control = (uint8_t *) buf;
	CC2520_PRINTF("cc2520: write: ");
	CC2520_PRINTF_PACKET(frame_control, len);
	/// Check with the IEEE frame control if ACK is needed
	/// NOTE maybe should be in unet_core
	if (frame_control[0] == 0x41) {
		CC2520_PRINTF("cc2520: ACK NOT needed!\n");
		radio_tx_ack(FALSE);
		radio_tx_acked(TRUE);
	}
	if (frame_control[0] == 0x61) {
		CC2520_PRINTF("cc2520: ACK needed!\n");
		radio_tx_ack(TRUE);
		radio_tx_acked(FALSE);
	}

	// Put the packet in the radio
	cc2520_prepare(buf, len);
	ret = cc2520_transmit();
	return ret;
}
/*---------------------------------------------------------------------------*/
/**
 * \brief Get message
 *
 *        This routine is used to retrieve a message stored in the RX_FIFO
 */
volatile int ifcall[2];
int32_t cc2520_get_rxfifo(uint8_t *buf, uint16_t buf_len) {
	volatile uint8_t len;
	uint8_t footer[2];

	if (!CC2520_FIFOP_IS_1) {
		// Something is wrong, probably some packet is beeing received
		return 0;
	}

	CC2520_READ_FIFO_BYTE(len);
	if (len > FOOTER_LEN && len < buf_len) { // not shorter, neither longer

		CC2520_READ_FIFO_BUF(buf, len - FOOTER_LEN);
		CC2520_READ_FIFO_BUF(footer, FOOTER_LEN);
		len = len - FOOTER_LEN;

		/// Print PKT
		CC2520_PRINTF("cc2520: pkt: ");
		CC2520_PRINTF_PACKET(buf,len);
		CC2520_PRINTF("cc2520: rssi&lqi: ");
		CC2520_PRINTF_PACKET(footer,FOOTER_LEN);

		/**
		 * APPEND_DATA_MODE:
		 * When AUTOCRC = 0:Don’t care
		 * When AUTOCRC = 1:
		 * 0: RSSI + The crc_ok bit and the 7 bit correlation value is
		 * appended at the end of each received frame
		 * 1: RSSI + The crc_ok bit and the 7 bit SRCRESINDEX is
		 * appended at the end of each received frame. See Table 15 for
		 * details.
		 */
		cc2520_radio_params.st_radio_param.crc = (footer[1] & FOOTER1_CRC_OK) >> 7; // get the CRC bit
		cc2520_radio_params.st_radio_param.last_rssi = buf[0];
		cc2520_radio_params.st_radio_param.last_lqi = buf[1] & FOOTER1_CORRELATION;

	} else {
		/* Oops, out of sync */
//		printf("cc2520: len %d\n",len);
		flushrx();
		len = 0;
	}

	if (CC2520_FIFOP_IS_1) {
		if (!CC2520_FIFO_IS_1) {
			/* Clean up in case of FIFO overflow!  This happens for every
			 * full length frame and is signaled by FIFOP = 1 and FIFO =
			 * 0. */
			flushrx();
		}
	}

	/* Enable packet reception */
	NODESTAT_UPDATE(radiorx);

	return len;
}
/*---------------------------------------------------------------------------*/
int cc2520_read(const void *buf, uint16_t *len) {
	/* Disable packet reception */
	CC2520_DISABLE_FIFOP_INT();
	cc2520_rx_disable();
	*len = cc2520_get_rxfifo((uint8_t *) buf, 128);
	cc2520_rx_enable();
	CC2520_ENABLE_FIFOP_INT();
	return 0;
}

//============================================================
//
//					     INTERRUPTIONS
//
//============================================================


/**
 * SFD Interrupt:
 * 1 - In TX indicates TX is done sending packet
 * 2 - In RX indicates that a complete frame has been received
 */
//static char ack_packet[CC2520_ACK_LENGTH];
extern INT8U iNesting;
#define interrupt(x) void __attribute__((interrupt (x)))
interrupt(PORT2_VECTOR) Radio_TX_Interrupt(void) {
	// ************************
	// Interruption entry
	// ************************
	OS_INT_ENTER();

	//// Page 53, Status Byte:
	//// "All instructions sent over the SPI to CC2520 result in a status byte being output on SO
	//// when the first byte of the instruction is clocked in on SI."

	// check if is CC2520 interruption
	if (P2IFG & BV(CC2520_SFD_PIN)) {
		// Clear interrupt flag
		CC2520_CLEAR_SFD_INT();

		/// TRANSMITTING
		if(is_cc2520_txing){

			// TX successful
			NODESTAT_UPDATE(radiotx);
			is_cc2520_txing = FALSE;

			// Will need to wait ACK?
			if(!is_radio_tx_ack(cc2520_radio_params.param[RADIO_STATE])){

				// Broadcast message, no ack needed
				UNET_RADIO.set(TX_STATUS, RADIO_TX_ERR_NONE);
				UNET_RADIO.set(TX_RETRIES, 0);

				// ACK is not needed, so release the unet core
				RADIO_STATE_SET(TX_OK);
			}

		}
//		/// RECEIVING, see Radio_RX_Interrupt
//		else{
//			cc2520_rx_disable(); // Disable to not overflow or flush rx buffer
//			// Check if it's a ACK message
//			final_status = getreg(CC2520_RXFIFOCNT);
//			if(final_status == CC2520_ACK_LENGTH){
////				CC2520_READ_FIFO_BUF(ack_packet, CC2520_ACK_LENGTH);
//				// If radio is TXing, then it's a ack message
//				if(is_radio_txing(cc2520_radio_params.param[RADIO_STATE])){
//					RADIO_STATE_SET(TX_ACKED); // ACK packet received, transmission ACKED
//					UNET_RADIO.set(TX_STATUS, RADIO_TX_ERR_NONE);
//					UNET_RADIO.set(TX_RETRIES, 0);
//
//					// ACK was expected, so release the unet core
//					RADIO_STATE_SET(TX_OK);
//				}
//
//				flushrx();
//				cc2520_rx_enable(); // Re-enable RX
//				RADIO_STATE_RESET(RX_OK);
//			}
//			else{
//				RADIO_STATE_SET(RX_OK);
//			}
//		}


		// Process unet_core isr handler
		_isr_handler();

	} else P2IFG = 0;

	// ************************
	// Interruption exit
	// ************************
	OS_INT_EXIT();
	// ************************
}


/*---------------------------------------------------------------------------*/
// \biref FIFOP interrupt, indicates RX activity
//static char ack_packet[CC2520_ACK_LENGTH];
//extern INT8U iNesting;
//#define interrupt(x) void __attribute__((interrupt (x)))
/** NOTE:
 *       Even this is the RX interruption manager,
 *       in the TX_Interrupt occur when the frame is read,
 *       BUT this interruption occur first!
 */
volatile char debug_one=0, debug_two=0;
volatile char rxfifocnt;
interrupt(PORT1_VECTOR) Radio_RX_Interrupt(void) {
	// ************************
	// Interruption entry
	// ************************
	OS_INT_ENTER();

	//// Page 53, Status Byte:
	//// "All instructions sent over the SPI to CC2520 result in a status byte being output on SO
	//// when the first byte of the instruction is clocked in on SI."

	// check if is CC2520 interruption
	if (P1IFG & BV(CC2520_FIFOP_PIN)) {
		// Clear interrupt flag
		CC2520_CLEAR_FIFOP_INT();

