fabricio-godoi/u4cQueue/uNET/radio/cc2520/cc2520_new.c
//		strobe(CC2520_INS_SRFOFF); // this shutdown the radio
		cc2520_rx_disable(); // Disable to not overflow or flush rx buffer

		debug_one = CC2520_FIFOP_IS_1;
		rxfifocnt = getreg(CC2520_RXFIFOCNT);
		debug_two = CC2520_FIFOP_IS_1;
		// Check if it's a ACK message
		if(rxfifocnt == CC2520_ACK_LENGTH){
//				CC2520_READ_FIFO_BUF(ack_packet, CC2520_ACK_LENGTH);
			// if(ack_packet[1] & 2) // it's ack
			// TODO check to be sure that is ACK packet FRM.CTRL = 2
			// If radio is TXing, then it's a ack message
			if(is_radio_txing(cc2520_radio_params.param[RADIO_STATE])){
				RADIO_STATE_SET(TX_ACKED); // ACK packet received, transmission ACKED
				UNET_RADIO.set(TX_STATUS, RADIO_TX_ERR_NONE);
				UNET_RADIO.set(TX_RETRIES, 0);

				// ACK was expected, so release the unet core
				RADIO_STATE_SET(TX_OK);
			}

			flushrx();
//			strobe(CC2520_INS_SRXON);
			cc2520_rx_enable(); // Re-enable RX
			RADIO_STATE_RESET(RX_OK);
		}
		// Packets smaller then ACK is a bug
		else if(rxfifocnt > CC2520_ACK_LENGTH){
			RADIO_STATE_SET(RX_OK);
		}


//		if(!CC2520_FIFOP_IS_1) printf("FOP\n");

		// Processa o unet_core_isr_handler
		_isr_handler();
	} else P1IFG = 0;

	// ************************
	// Interruption exit
	// ************************
	OS_INT_EXIT();
	// ************************
}
//
///**
// * SFD Interrupt:
// * 1 - In TX indicates TX is done sending packet
// * 2 - In RX indicates that a complete frame has been received
// */
//#define interrupt(x) void __attribute__((interrupt (x)))
//interrupt(PORT2_VECTOR) Radio_TX_Interrupt(void) {
//	// ************************
//	// Interruption entry
//	// ************************
//	OS_INT_ENTER();
//
//	//// Page 53, Status Byte:
//	//// "All instructions sent over the SPI to CC2520 result in a status byte being output on SO
//	//// when the first byte of the instruction is clocked in on SI."
//
//	// check if is CC2520 interruption
//	if (P2IFG & BV(CC2520_SFD_PIN)) {
//		// Clear interrupt flag
//		CC2520_CLEAR_SFD_INT();
//
//
//		// Radio was transmitting?
//		if(is_cc2520_txing){
//
//			// Radio finished the transmission
//			is_cc2520_txing = FALSE;
//
//			// Put radio to RX
//			cc2520_rx_enable();
//
//			NODESTAT_UPDATE(radiotx);
//			// Will need to wait ACK?
//			if (is_radio_tx_ack(cc2520_radio_params.param[RADIO_STATE])){
//				// TX sent, but no acked
//				UNET_RADIO.set(TX_STATUS, RADIO_TX_WAIT);
//				CC2520_PRINTF("cc2520: TX WAIT ACK\n"); // waiting ack
//			}
//			else {
//				// Broadcast message, no ack needed
//	//				radio_tx_acked(TRUE);
//				UNET_RADIO.set(TX_STATUS, RADIO_TX_ERR_NONE);
//				UNET_RADIO.set(TX_RETRIES, 0);
//				CC2520_PRINTF("cc2520: TX OK\n");
//
//				// ACK is not needed, so release the unet core
//				radio_txing(TRUE);
//				// Processa o unet_core_isr_handler
//				_isr_handler();
//			}
//
//
//		}
//
//
//	} else P2IFG = 0;
//
//	// ************************
//	// Interruption exit
//	// ************************
//	OS_INT_EXIT();
//	// ************************
//}


//============================================================
//
//					        DRIVER
//
//============================================================

int _isr(const void *isr_handler) {
	_isr_handler = isr_handler;
	return 0;
}

/*---------------------------------------------------------------------------*/
const struct radio_driver cc2520_driver = { cc2520_init, cc2520_read,
		cc2520_write, cc2520_set, cc2520_get, _isr };
/*---------------------------------------------------------------------------*/

/** @} */
